cociorbaandrei/LOGITacker_nrf52832/pca10040/blank/ses/nrf_esb_illegalmod.h
/**
 * This is a modified version of the nrf_esb library by Marcus Mengs.
 * The original library is provided with the nRF5 SDK by Nordic Semiconductor ASA.
 * The copyright notice from the unmodified library could be found below.
 *
 * Many changes have been made to the library in order to support pseudo-promiscuous
 * mode for ESB, amongst these changes:
 *
 * - Pseudo promiscuous mode has a "post processing step" (checks valid ESB frames
 * in received noise). As this adds a huge amount of computation overhead, it was
 * off-loaded to app_scheduler. Thus the library depends on app_scheduler.
 * - The promiscuous mode post processing step, optionally checks captured ESB frames
 * to be valid Logitech RF communication (additional vendor checksum, special length).
 * Thus it depends on the `logitacker_unifying" module and can't be used stand-alone.
 * This behavior could be changed by un-setting the `LOGITECH_FILTER` definition in
 * `nrf_esb_illegalmod.h`
 * - Additional operation modes for the radio are deployed and used by Logitacker.
 * For example the mode `NRF_ESB_MODE_PTX_STAY_RX` which puts the radio into PTX mode,
 * but toggles back AND STAYS in PRX mode after a single transmission. This was implemented
 * to reduce timing overhead of manual toggling between PRX and PTX to an absolute minimum
 * (utilizes PPI and proper SHORTS)
 * - The `nrf_esb_payload_t` data structure contains a boolean field called `noack`.
 * This boolean is connected to the no-acknowledge bit in the Packet Control Field (PCF)
 * of an ESB frame. The unmodified `nrf_esb` library unsets the no-acknowledge bit in the
 * PCF field if the `noack`boolean in the data structure is set to true (somehow reversed
 * behavior). This has been changed in the `nrf_esb_illegalmod` library: If the `noack`
 * boolean is set to true, the no-acknowledgment bit of the resulting ESB frame is set
 * (not unset) before transmission.
 *
 * Note: The term `illegal`in the library name refers to undocumented register settings
 * used for the nRF52844 radio, in order to obtain pseudo promiscuous RX capabilities.
 * It does not mean that something illegal (in common sense of the word) is done by this
 * library
 *
 */

/**
 * Copyright (c) 2016 - 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef __NRF_ESB_ILLEGALMOD_H
#define __NRF_ESB_ILLEGALMOD_H

#include <stdbool.h>
#include <stdint.h>
#include "nrf.h"
#include "app_util.h"


#ifdef __cplusplus
extern "C" {
#endif

#define NRF_ESB_PROMISCUOUS_PAYLOAD_ADDITIONAL_LENGTH 18

/*
 * In promiscuous mode, all captured frames produce a NRF_ESB_EVENT_RX_RECEIVED event
 *
 * If NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER is enabled, promiscuous mode frames are additionally
 * processed to check CRC16 and bitshift the whole frame several times (and check CRC again) to raise the
 * chance of capturing valid frames. This requires that the main loop processes app_scheduler. ONLY in case a valid frame
 * is found, an NRF_ESB_EVENT_RX_RECEIVED event is generated in promiscuous mode and the validated frame
 * gets queued in the RX fifo (shifted corerectly).
 * 
*/
#define     NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER        true // if true, promiscuous mode frames are validated using app_scheduler ()
#define     NRF_ESB_CHECK_PROMISCUOUS_SCHED_EVENT_DATA_SIZE         sizeof(nrf_esb_payload_t)
#define     NRF_ESB_CHECK_PROMISCUOUS_CRC_WITH_APP_SCHEDULER_ENQUEUE_INVALID true // if enabled, invalid frames are send to RX fifo, too (but validated_promiscuous_frame flag won't be set)

#define     NRF_ESB_RETRANSMIT_DELAY_MIN        135

// Hardcoded parameters - change if necessary
#ifndef NRF_ESB_MAX_PAYLOAD_LENGTH
#define     NRF_ESB_MAX_PAYLOAD_LENGTH          32                  //!< The maximum size of the payload. Valid values are 1 to 252.
#endif

#define     NRF_ESB_TX_FIFO_SIZE                8                   //!< The size of the transmission first-in, first-out buffer.
#define     NRF_ESB_RX_FIFO_SIZE                16                   //!< The size of the reception first-in, first-out buffer.

// 252 is the largest possible payload size according to the nRF5 architecture.
STATIC_ASSERT(NRF_ESB_MAX_PAYLOAD_LENGTH <= 252);

#define     NRF_ESB_SYS_TIMER                   NRF_TIMER2          //!< The timer that is used by the module.
#define     NRF_ESB_SYS_TIMER_IRQ_Handler       TIMER2_IRQHandler   //!< The handler that is used by @ref NRF_ESB_SYS_TIMER.

#define     NRF_ESB_PPI_TIMER_START             10                  //!< The PPI channel used for starting the timer.
#define     NRF_ESB_PPI_TIMER_STOP              11                  //!< The PPI channel used for stopping the timer.
#define     NRF_ESB_PPI_RX_TIMEOUT              12                  //!< The PPI channel used for RX time-out.
#define     NRF_ESB_PPI_TX_START                13                  //!< The PPI channel used for starting TX.

#ifndef NRF_ESB_PIPE_COUNT
#define     NRF_ESB_PIPE_COUNT                  8                   //!< The maximum number of pipes allowed in the API, can be used if you need to restrict the number of pipes used. Must be 8 or lower because of architectural limitations.
#endif
STATIC_ASSERT(NRF_ESB_PIPE_COUNT <= 8);

/**@cond NO_DOXYGEN */
#ifdef NRF52832_XXAA
// nRF52 address fix timer and PPI defines
#define     NRF_ESB_PPI_BUGFIX1                 9
#define     NRF_ESB_PPI_BUGFIX2                 8
#define     NRF_ESB_PPI_BUGFIX3                 7

#define     NRF_ESB_BUGFIX_TIMER                NRF_TIMER3
#define     NRF_ESB_BUGFIX_TIMER_IRQn           TIMER3_IRQn
#define     NRF_ESB_BUGFIX_TIMER_IRQHandler     TIMER3_IRQHandler
#endif

/** @endcond */

// Interrupt flags
#define     NRF_ESB_INT_TX_SUCCESS_MSK          0x01                //!< The flag used to indicate a success since the last event.
#define     NRF_ESB_INT_TX_FAILED_MSK           0x02                //!< The flag used to indicate a failure since the last event.
#define     NRF_ESB_INT_RX_DR_MSK               0x04                //!< The flag used to indicate that a packet was received since the last event.

